const Discord = require("discord.js");
const client = new Discord.Client();
const yt = require('ytdl-core');
 //صانع الكود @LEGEND_YT#4537
 //صانع الكود @LEGEND_YT#4537
 //صانع الكود @LEGEND_YT#4537
const prefix = '*'//تقد تغير البرفكس للي تبيه
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on('ready', () => {//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`Logged in as ${client.user.tag}!`);//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`in ${client.guilds.size} servers `)//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`[Users] ${client.users.size}`)//الحقوق كامله محفوضه لدا سيرفر الفا
});//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function commandIs(str, msg){//الحقوق كامله محفوضه لدا سيرفر الفا
    return msg.content.toLowerCase().startsWith('*' + str);//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function pluck(array) {//الحقوق كامله محفوضه لدا سيرفر الفا
    return array.map(function(item) { return item['name']; });//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function hasRole(mem, role) {//الحقوق كامله محفوضه لدا سيرفر الفا
    if(pluck(mem.roles).includes(role)){//الحقوق كامله محفوضه لدا سيرفر الفا
        return true;//الحقوق كامله محفوضه لدا سيرفر الفا
    } else {//الحقوق كامله محفوضه لدا سيرفر الفا
        return false;//الحقوق كامله محفوضه لدا سيرفر الفا
    }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var servers = {};//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
var q1 = "*quran 1"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q2 = "*quran 2"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q3 = "*quran 3"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q4 = "*quran 4"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q5 = "*quran 5"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q6 = "*quran 6"//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
var q7 = "*quran 7"//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function play(connection, message) {//الحقوق كامله محفوضه لدا سيرفر الفا
    var server = servers[message.guild.id];//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
   server.dispatcher = connection.playStream(yt(server.queue[0], { fliter: "audionly" }));//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
    server.queue.shift();//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
    server.dispatcher.on("end", function() {//الحقوق كامله محفوضه لدا سيرفر الفا
        if (server.queue[0]) play(connection, message);//الحقوق كامله محفوضه لدا سيرفر الفا
        else connection.disconnect();//الحقوق كامله محفوضه لدا سيرفر الفا
    });//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on("ready", () => {//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`Quran bot is in ${client.guilds.size} servers `)//الحقوق كامله محفوضه لدا سيرفر الفا
});//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var PREFIX = "*";//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on("message", message => {//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                        if (message.content === q1 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);  
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=V4b9f9BQTKI', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                        if (message.content === q2 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://youtu.be/0m02xNtR8gA', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                            if (message.content === q3 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=4JvY-MccxNk', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                            if (message.content === q4 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=Ktync4j_nmA', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                              if (message.content === q5 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=JavxHrNSZlg', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                                  if (message.content === q6 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=WYT0pQne-7w', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
                                      if (message.content === q7 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=3XV0ejeQG_M', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
   //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
  if(message.content === "*stop" ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                var servers = {};//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
            if (message.guild.voiceConnection) message.guild.voiceConnection.disconnect();//الحقوق كامله محفوضه لدا سيرفر الفا
   //الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 if(message.content === "*help") {//الحقوق كامله محفوضه لدا سيرفر الفا
   message.channel.send(` QuranBot//الحقوق كامله محفوضه لدا سيرفر الفا
● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●//الحقوق كامله محفوضه لدا سيرفر الفا
     🕋اوامر البوت 🕋
اذكار: يعرض لك الاذكار
 
● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●
        **اوامر تشغيل القران**  
:mosque: *quran 1  |  القران الكريم كامل بصوت الشيخ عبدالباسط عبدالصمد
:mosque: *quran 2 | سورة البقرة كاملة - القارئ الحاج ميثم التمار (QURAN)
:mosque: *quran 3 | القرآن الكريم كامل بصوت الشيخ عبد الرحمن السديس وسعود الشريم
:mosque: *quran 4 | القرآن الكريم كامل بصوت الشيخ المعيقلي
:mosque: *quran 5 |  سورة البقرة بصوت وتلاوة يخشع لها الحجر بدل القلب (الشيخ اسلام صبحي
:mosque: *quran 6 | الشيخ ياسر الدوسري القرآن الكريم كامل
:mosque: *quran 7 | القرآن الكريم كاملا بصوت الشيخ بندر بليلة
:mosque: *stop |  لـ أيقاف تشغيل البوت
● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●
 `)
 }
 
       
});//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
        //الحقوق كامله محفوضه لدا سيرفر الفا
client.on('message', message => {//الحقوق كامله محفوضه لدا سيرفر الفا
  if(message.content === "*bot") {//الحقوق كامله محفوضه لدا سيرفر الفا
      const embed = new Discord.RichEmbed()//الحقوق كامله محفوضه لدا سيرفر الفا
      .setColor("#00FFFF")//الحقوق كامله محفوضه لدا سيرفر الفا
      .setDescription(`**Servers**🌐 **__${client.guilds.size}__**//الحقوق كامله محفوضه لدا سيرفر الفا
**Users**👥 **__${client.users.size}__**//الحقوق كامله محفوضه لدا سيرفر الفا
**Channels**📚 **__${client.channels.size}__** `)//الحقوق كامله محفوضه لدا سيرفر الفا
             message.channel.sendEmbed(embed);//الحقوق كامله محفوضه لدا سيرفر الفا
         }ر//الحقوق كامله محفوضه لدا سيرفر الفا
});//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
var adkar = [//الحقوق كامله محفوضه لدا سيرفر الفا
  '**اذكار  | **اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ.',
  '**اذكار  |  **اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى. ',
  '**اذكار  ‏|  **اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ، وَجِلَّهُ، وَأَوَّلَهُ، وَآخِرَهُ، وَعَلَانِيَتَهُ، وَسِرَّهُ. ',
  '**‏اذكار  |  **أستغفر الله .',
  '**‏اذكار  | **الْلَّهُ أَكْبَرُ',
  '**‏اذكار  |  **لَا إِلَهَ إِلَّا اللَّهُ',//الحقوق كامله محفوضه لدا سيرفر الفا
  '**اذكار  |  **الل��َهُمّ�� صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.',
  '**اذكار  |  **سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ',
  '**اذكار  | **لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.',
  '**اذكار  | **أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ',
  '**‏اذكار  | **سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ',
  '‏**اذكار**|  لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
  '**اذكار  ‏|   **اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.',
  '**اذكار  | ‏ **يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.',
  'اذكار    |  **أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.**',
  '**‏اذكار  |  **اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
  '**‏اذكار  |  **اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ',
  '**‏اذكار  |  **أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
  '**اذكار  |  **يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ',
  '**اذكار  |  **اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.',
  '**‏اذكار  |  **اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.',
  '**‏اذكار  |  **سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. ',
  '**‏اذكار  |  **اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.',
  '**‏اذكار  |  **بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. ',
  '**‏اذكار  |  **حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
  '**اذكار  |  **اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
  '**‏اذكار  |  **اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
  '**‏اذكار  |  **رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً',
  '**‏اذكار  |  **اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، وعذاب القبر، اللهم آت نفسي تقواها، وزكها أنت خير من زكاها. أنت وليها ومولاها. اللهم إني أعوذ بك من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها',
  '**‏اذكار  |  **اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل',
  '**‏اذكار  |  **اللهم مصرف القلوب صرف قلوبنا على طاعتك',
];//الحقوق كامله محفوضه لدا سيرفر الفا
client.on('message', message => {//الحقوق كامله محفوضه لدا سيرفر الفا
  if (message.author.bot) return;//الحقوق كامله محفوضه لدا سيرفر الفا
  if (message.content.startsWith('اذكار')) {//الحقوق كامله محفوضه لدا سيرفر الفا
    if(!message.channel.guild) return;//الحقوق كامله محفوضه لدا سيرفر الفا
  var client= new Discord.RichEmbed()//الحقوق كامله محفوضه لدا سيرفر الفا
  .setTitle("اذكار")//الحقوق كامله محفوضه لدا سيرفر الفا
  .setThumbnail(message.author.avatarURL)//الحقوق كامله محفوضه لدا سيرفر الفا
  .setColor('RANDOM')//الحقوق كامله محفوضه لدا سيرفر الفا
  .setDescription(`${adkar[Math.floor(Math.random() * adkar.length)]}`)//الحقوق كامله محفوضه لدا سيرفر الفا
                 .setTimestamp()//الحقوق كامله محفوضه لدا سيرفر الفا
  message.channel.sendEmbed(client);//الحقوق كامله محفوضه لدا سيرفر الفا
  message.react("🕋")//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
  });//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا








 
  
  
client.login(process.env.BOT_TOKEN);
