const Discord = require("discord.js");
const client = new Discord.Client();
const yt = require('ytdl-core');

const prefix = '%'//تقد تغير البرفكس للي تبيه
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on('ready', () => {//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`Logged in as ${client.user.tag}!`);//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`in ${client.guilds.size} servers `)//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`[Users] ${client.users.size}`)//الحقوق كامله محفوضه لدا سيرفر الفا
});//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function commandIs(str, msg){//الحقوق كامله محفوضه لدا سيرفر الفا
    return msg.content.toLowerCase().startsWith('*' + str);//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function pluck(array) {//الحقوق كامله محفوضه لدا سيرفر الفا
    return array.map(function(item) { return item['name']; });//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
function hasRole(mem, role) {//الحقوق كامله محفوضه لدا سيرفر الفا
    if(pluck(mem.roles).includes(role)){//الحقوق كامله محفوضه لدا سيرفر الفا
        return true;//الحقوق كامله محفوضه لدا سيرفر الفا
    } else {//الحقوق كامله محفوضه لدا سيرفر الفا
        return false;//الحقوق كامله محفوضه لدا سيرفر الفا
    }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var servers = {};

var q1 = "%قران 1"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q2 = "%قران 2"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q3 = "%قران 3"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q4 = "%قران 4"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q5 = "%قران 5"//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var q6 = "%قران 6"//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
var q7 = "%قران 7"//الحقوق كامله محفوضه لدا سيرفر الفا

function play(connection, message) {//الحقوق كامله محفوضه لدا سيرفر الفا
    var server = servers[message.guild.id];//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
   server.dispatcher = connection.playStream(yt(server.queue[0], { fliter: "audionly" }));//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
    server.queue.shift();//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
    server.dispatcher.on("end", function() {//الحقوق كامله محفوضه لدا سيرفر الفا
        if (server.queue[0]) play(connection, message);//الحقوق كامله محفوضه لدا سيرفر الفا
        else connection.disconnect();//الحقوق كامله محفوضه لدا سيرفر الفا
    });//الحقوق كامله محفوضه لدا سيرفر الفا
}//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on("ready", () => {//الحقوق كامله محفوضه لدا سيرفر الفا
    console.log(`Quran bot is in ${client.guilds.size} servers `)//الحقوق كامله محفوضه لدا سيرفر الفا
});//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
var PREFIX = "%";//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
client.on("message", message => {//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                        if (message.content === q1 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);  
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=V4b9f9BQTKI', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                        if (message.content === q2 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=rP18g3VSnaM', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                            if (message.content === q3 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=4Zr--4eLKPA', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
      });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                            if (message.content === q4 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=Ktync4j_nmA', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                              if (message.content === q5 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=_gzGlmWpocM', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
                                  if (message.content === q6 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=WYT0pQne-7w', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
                                      if (message.content === q7 ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                  message.react('🔊')//الحقوق كامله محفوضه لدا سيرفر الفا
    const voiceChannel = message.member.voiceChannel;//الحقوق كامله محفوضه لدا سيرفر الفا
    if (!voiceChannel) {//الحقوق كامله محفوضه لدا سيرفر الفا
      return message.reply(`يرجى أن تكون في قناة صوتيه أولا!`);
    }//الحقوق كامله محفوضه لدا سيرفر الفا
    voiceChannel.join()//الحقوق كامله محفوضه لدا سيرفر الفا
      .then(connnection => {//الحقوق كامله محفوضه لدا سيرفر الفا
        let stream = yt('https://www.youtube.com/watch?v=a-JdEFdgBaU', {audioonly: true});//الحقوق كامله محفوضه لدا سيرفر الفا
        const dispatcher = connnection.playStream(stream);//الحقوق كامله محفوضه لدا سيرفر الفا
        });//الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
    //الحقوق كامله محفوضه لدا سيرفر الفا
   //الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
  if(message.content === "%توقف" ) {//الحقوق كامله محفوضه لدا سيرفر الفا
                var servers = {};//الحقوق كامله محفوضه لدا سيرفر الفا
 //الحقوق كامله محفوضه لدا سيرفر الفا
            if (message.guild.voiceConnection) message.guild.voiceConnection.disconnect();//الحقوق كامله محفوضه لدا سيرفر الفا
   //الحقوق كامله محفوضه لدا سيرفر الفا
  }//الحقوق كامله محفوضه لدا سيرفر الفا
//الحقوق كامله محفوضه لدا سيرفر الفا
 if(message.content === "%القران") {//الحقوق كامله محفوضه لدا سيرفر الفا
   message.channel.send(` **القران الكريم**
**● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●
     🕋اوامر البوت 🕋
اذكار: يعرض لك الاذكار

● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●
        اوامر تشغيل القران  
:mosque: %قران 1 
|   القران الكريم كامل بصوت الشيخ عبد الباسط عبدالصمد|
:mosque: %قران 2
| القران الكريم كامل الشيخ أحمد العجمي |
:mosque: %قران 3
| القرآن الكريم كامل بصوت الشيخ فارس عبّاد|
:mosque: %قران 4
| القرآن الكريم كامل بصوت الشيخ ماهر المعيقلي|
:mosque: %قران 5
|  القران الكريم كامل بصوت الشيخ محمد أنور الشحات|
:mosque: %قران 6
| القران الكريم كامل بصوت الشيخ ياسر الدوسري|
:mosque: %قران 7
| القرآن الكريم كامل بصوت الشيخ عبدا لرحمن السديس|
:mosque: %توقف
|  أيقاف القران|
● ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ●**
 `)
 }





























 
  
  
client.login(process.env.BOT_TOKEN);
